MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA406/mcu.h
extern volatile IOCPDBBITS IOCPDBbits __attribute__((__sfr__));

#define TRISC TRISC
extern volatile uint16_t TRISC __attribute__((__sfr__));
typedef struct tagTRISCBITS {
  uint16_t :12;
  uint16_t TRISC12:1;
  uint16_t TRISC13:1;
  uint16_t TRISC14:1;
  uint16_t TRISC15:1;
} TRISCBITS;
extern volatile TRISCBITS TRISCbits __attribute__((__sfr__));

#define PORTC PORTC
extern volatile uint16_t PORTC __attribute__((__sfr__));
typedef struct tagPORTCBITS {
  uint16_t :12;
  uint16_t RC12:1;
  uint16_t RC13:1;
  uint16_t RC14:1;
  uint16_t RC15:1;
} PORTCBITS;
extern volatile PORTCBITS PORTCbits __attribute__((__sfr__));

#define LATC LATC
extern volatile uint16_t LATC __attribute__((__sfr__));
typedef struct tagLATCBITS {
  uint16_t :12;
  uint16_t LATC12:1;
  uint16_t :2;
  uint16_t LATC15:1;
} LATCBITS;
extern volatile LATCBITS LATCbits __attribute__((__sfr__));

#define ODCC ODCC
extern volatile uint16_t ODCC __attribute__((__sfr__));
typedef struct tagODCCBITS {
  uint16_t :12;
  uint16_t ODCC12:1;
  uint16_t :2;
  uint16_t ODCC15:1;
} ODCCBITS;
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile uint16_t ANSC __attribute__((__sfr__));
#define ANSELC ANSELC
extern volatile uint16_t ANSELC __attribute__((__sfr__));
#define IOCPC IOCPC
extern volatile uint16_t IOCPC __attribute__((__sfr__));
typedef struct tagIOCPCBITS {
  uint16_t :12;
  uint16_t IOCPC12:1;
  uint16_t IOCPC13:1;
  uint16_t IOCPC14:1;
  uint16_t IOCPC15:1;
} IOCPCBITS;
extern volatile IOCPCBITS IOCPCbits __attribute__((__sfr__));

#define IOCNC IOCNC
extern volatile uint16_t IOCNC __attribute__((__sfr__));
typedef struct tagIOCNCBITS {
  uint16_t :12;
  uint16_t IOCNC12:1;
  uint16_t IOCNC13:1;
  uint16_t IOCNC14:1;
  uint16_t IOCNC15:1;
} IOCNCBITS;
extern volatile IOCNCBITS IOCNCbits __attribute__((__sfr__));

#define IOCFC IOCFC
extern volatile uint16_t IOCFC __attribute__((__sfr__));
typedef struct tagIOCFCBITS {
  uint16_t :12;
  uint16_t IOCFC12:1;
  uint16_t IOCFC13:1;
  uint16_t IOCFC14:1;
  uint16_t IOCFC15:1;
} IOCFCBITS;
extern volatile IOCFCBITS IOCFCbits __attribute__((__sfr__));

#define CNPUC CNPUC
extern volatile uint16_t CNPUC __attribute__((__sfr__));
__extension__ typedef struct tagCNPUCBITS {
  union {
    struct {
      uint16_t :12;
      uint16_t IOCPC12:1;
      uint16_t :2;
      uint16_t IOCPC15:1;
    };
    struct {
      uint16_t :12;
      uint16_t IOCPUC12:1;
      uint16_t :2;
      uint16_t IOCPUC15:1;
    };
    struct {
      uint16_t :12;
      uint16_t CNPUC12:1;
      uint16_t :2;
      uint16_t CNPUC15:1;
    };
  };
} CNPUCBITS;
extern volatile CNPUCBITS CNPUCbits __attribute__((__sfr__));

#define IOCPUC IOCPUC
extern volatile uint16_t IOCPUC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUCBITS {
  union {
    struct {
      uint16_t :12;
      uint16_t IOCPC12:1;
      uint16_t :2;
      uint16_t IOCPC15:1;
    };
    struct {
      uint16_t :12;
      uint16_t IOCPUC12:1;
      uint16_t :2;
      uint16_t IOCPUC15:1;
    };
    struct {
      uint16_t :12;
      uint16_t CNPUC12:1;
      uint16_t :2;
      uint16_t CNPUC15:1;
    };
  };
} IOCPUCBITS;
extern volatile IOCPUCBITS IOCPUCbits __attribute__((__sfr__));

#define CNPDC CNPDC
extern volatile uint16_t CNPDC __attribute__((__sfr__));
__extension__ typedef struct tagCNPDCBITS {
  union {
    struct {
      uint16_t :12;
      uint16_t IOCPDC12:1;
      uint16_t :2;
      uint16_t IOCPDC15:1;
    };
    struct {
      uint16_t :12;
      uint16_t CNPDC12:1;
      uint16_t :2;
      uint16_t CNPDC15:1;
    };
  };
} CNPDCBITS;
extern volatile CNPDCBITS CNPDCbits __attribute__((__sfr__));

#define IOCPDC IOCPDC
extern volatile uint16_t IOCPDC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDCBITS {
  union {
    struct {
      uint16_t :12;
      uint16_t IOCPDC12:1;
      uint16_t :2;
      uint16_t IOCPDC15:1;
    };
    struct {
      uint16_t :12;
      uint16_t CNPDC12:1;
      uint16_t :2;
      uint16_t CNPDC15:1;
    };
  };
} IOCPDCBITS;
extern volatile IOCPDCBITS IOCPDCbits __attribute__((__sfr__));

#define TRISD TRISD
extern volatile uint16_t TRISD __attribute__((__sfr__));
typedef struct tagTRISDBITS {
  uint16_t TRISD0:1;
  uint16_t TRISD1:1;
  uint16_t TRISD2:1;
  uint16_t TRISD3:1;
  uint16_t TRISD4:1;
  uint16_t TRISD5:1;
  uint16_t TRISD6:1;
  uint16_t TRISD7:1;
  uint16_t TRISD8:1;
  uint16_t TRISD9:1;
  uint16_t TRISD10:1;
  uint16_t TRISD11:1;
} TRISDBITS;
extern volatile TRISDBITS TRISDbits __attribute__((__sfr__));

#define PORTD PORTD
extern volatile uint16_t PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  uint16_t RD0:1;
  uint16_t RD1:1;
  uint16_t RD2:1;
  uint16_t RD3:1;
  uint16_t RD4:1;
  uint16_t RD5:1;
  uint16_t RD6:1;
  uint16_t RD7:1;
  uint16_t RD8:1;
  uint16_t RD9:1;
  uint16_t RD10:1;
  uint16_t RD11:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

#define LATD LATD
extern volatile uint16_t LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  uint16_t LATD0:1;
  uint16_t LATD1:1;
  uint16_t LATD2:1;
  uint16_t LATD3:1;
  uint16_t LATD4:1;
  uint16_t LATD5:1;
  uint16_t LATD6:1;
  uint16_t LATD7:1;
  uint16_t LATD8:1;
  uint16_t LATD9:1;
  uint16_t LATD10:1;
  uint16_t LATD11:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

#define ODCD ODCD
extern volatile uint16_t ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  uint16_t ODCD0:1;
  uint16_t ODCD1:1;
  uint16_t ODCD2:1;
  uint16_t ODCD3:1;
  uint16_t ODCD4:1;
  uint16_t ODCD5:1;
  uint16_t ODCD6:1;
  uint16_t ODCD7:1;
  uint16_t ODCD8:1;
  uint16_t ODCD9:1;
  uint16_t ODCD10:1;
  uint16_t ODCD11:1;
} ODCDBITS;
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define ANSD ANSD
extern volatile uint16_t ANSD __attribute__((__sfr__));
__extension__ typedef struct tagANSDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
    };
  };
} ANSDBITS;
extern volatile ANSDBITS ANSDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t ANSELD __attribute__((__sfr__));
__extension__ typedef struct tagANSELDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
    };
  };
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define IOCPD IOCPD
extern volatile uint16_t IOCPD __attribute__((__sfr__));
typedef struct tagIOCPDBITS {
  uint16_t IOCPD0:1;
  uint16_t IOCPD1:1;
  uint16_t IOCPD2:1;
  uint16_t IOCPD3:1;
  uint16_t IOCPD4:1;
  uint16_t IOCPD5:1;
  uint16_t IOCPD6:1;
  uint16_t IOCPD7:1;
  uint16_t IOCPD8:1;
  uint16_t IOCPD9:1;
  uint16_t IOCPD10:1;
  uint16_t IOCPD11:1;
} IOCPDBITS;
extern volatile IOCPDBITS IOCPDbits __attribute__((__sfr__));

#define IOCND IOCND
extern volatile uint16_t IOCND __attribute__((__sfr__));
typedef struct tagIOCNDBITS {
  uint16_t IOCND0:1;
  uint16_t IOCND1:1;
  uint16_t IOCND2:1;
  uint16_t IOCND3:1;
  uint16_t IOCND4:1;
  uint16_t IOCND5:1;
  uint16_t IOCND6:1;
  uint16_t IOCND7:1;
  uint16_t IOCND8:1;
  uint16_t IOCND9:1;
  uint16_t IOCND10:1;
  uint16_t IOCND11:1;
} IOCNDBITS;
