MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA406/mcu.h
extern volatile AD1CSSLBITS AD1CSSLbits __attribute__((__sfr__));

#define AD1CON4 AD1CON4
extern volatile uint16_t AD1CON4 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON4BITS {
  union {
    struct {
      uint16_t DMABL:3;
    };
    struct {
      uint16_t DMABL0:1;
      uint16_t DMABL1:1;
      uint16_t DMABL2:1;
    };
  };
} AD1CON4BITS;
extern volatile AD1CON4BITS AD1CON4bits __attribute__((__sfr__));

#define AD1CON5 AD1CON5
extern volatile uint16_t AD1CON5 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON5BITS {
  union {
    struct {
      uint16_t CM:2;
      uint16_t WM:2;
      uint16_t :4;
      uint16_t ASINT:2;
      uint16_t :2;
      uint16_t BGREQ:1;
      uint16_t CTMREQ:1;
      uint16_t LPEN:1;
      uint16_t ASEN:1;
    };
    struct {
      uint16_t CM0:1;
      uint16_t CM1:1;
      uint16_t WM0:1;
      uint16_t WM1:1;
      uint16_t :4;
      uint16_t ASINT0:1;
      uint16_t ASINT1:1;
    };
  };
} AD1CON5BITS;
extern volatile AD1CON5BITS AD1CON5bits __attribute__((__sfr__));

#define AD1CHITH AD1CHITH
extern volatile uint16_t AD1CHITH __attribute__((__sfr__));
typedef struct tagAD1CHITHBITS {
  uint16_t :8;
  uint16_t CHH24:1;
  uint16_t CHH25:1;
} AD1CHITHBITS;
extern volatile AD1CHITHBITS AD1CHITHbits __attribute__((__sfr__));

#define AD1CHITL AD1CHITL
extern volatile uint16_t AD1CHITL __attribute__((__sfr__));
typedef struct tagAD1CHITLBITS {
  uint16_t CHH0:1;
  uint16_t CHH1:1;
  uint16_t CHH2:1;
  uint16_t CHH3:1;
  uint16_t CHH4:1;
  uint16_t CHH5:1;
  uint16_t CHH6:1;
  uint16_t CHH7:1;
  uint16_t CHH8:1;
  uint16_t CHH9:1;
  uint16_t CHH10:1;
  uint16_t CHH11:1;
  uint16_t CHH12:1;
  uint16_t CHH13:1;
  uint16_t CHH14:1;
  uint16_t CHH15:1;
} AD1CHITLBITS;
extern volatile AD1CHITLBITS AD1CHITLbits __attribute__((__sfr__));

#define AD1CTMENH AD1CTMENH
extern volatile uint16_t AD1CTMENH __attribute__((__sfr__));
typedef struct tagAD1CTMENHBITS {
  uint16_t :8;
  uint16_t CTMEN24:1;
  uint16_t CTMEN25:1;
  uint16_t :2;
  uint16_t CTMEN28:1;
  uint16_t CTMEN29:1;
  uint16_t CTMEN30:1;
  uint16_t CTMEN31:1;
} AD1CTMENHBITS;
extern volatile AD1CTMENHBITS AD1CTMENHbits __attribute__((__sfr__));

#define AD1CTMENL AD1CTMENL
extern volatile uint16_t AD1CTMENL __attribute__((__sfr__));
typedef struct tagAD1CTMENLBITS {
  uint16_t CTMEN0:1;
  uint16_t CTMEN1:1;
  uint16_t CTMEN2:1;
  uint16_t CTMEN3:1;
  uint16_t CTMEN4:1;
  uint16_t CTMEN5:1;
  uint16_t CTMEN6:1;
  uint16_t CTMEN7:1;
  uint16_t CTMEN8:1;
  uint16_t CTMEN9:1;
  uint16_t CTMEN10:1;
  uint16_t CTMEN11:1;
  uint16_t CTMEN12:1;
  uint16_t CTMEN13:1;
  uint16_t CTMEN14:1;
  uint16_t CTMEN15:1;
} AD1CTMENLBITS;
extern volatile AD1CTMENLBITS AD1CTMENLbits __attribute__((__sfr__));

#define AD1DMBUF AD1DMBUF
extern volatile uint16_t AD1DMBUF __attribute__((__sfr__));
__extension__ typedef struct tagAD1DMBUFBITS {
  union {
    struct {
      uint16_t AD1RESDMA:16;
    };
    struct {
      uint16_t AD1DMBUF:16;
    };
  };
} AD1DMBUFBITS;
extern volatile AD1DMBUFBITS AD1DMBUFbits __attribute__((__sfr__));

#define AD1RESDMA AD1RESDMA
extern volatile uint16_t AD1RESDMA __attribute__((__sfr__));
__extension__ typedef struct tagAD1RESDMABITS {
  union {
    struct {
      uint16_t AD1RESDMA:16;
    };
    struct {
      uint16_t AD1DMBUF:16;
    };
  };
} AD1RESDMABITS;
extern volatile AD1RESDMABITS AD1RESDMAbits __attribute__((__sfr__));

#define NVMCON NVMCON
extern volatile uint16_t NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      uint16_t NVMOP:4;
      uint16_t :6;
      uint16_t P2ACTIV:1;
      uint16_t SFTSWP:1;
      uint16_t NVMSIDL:1;
      uint16_t WRERR:1;
      uint16_t WREN:1;
      uint16_t WR:1;
    };
    struct {
      uint16_t NVMOP0:1;
      uint16_t NVMOP1:1;
      uint16_t NVMOP2:1;
      uint16_t NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile uint16_t NVMADR __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t NVMADRL:15;
    };
    struct {
      uint16_t :1;
      uint16_t NVMADR:15;
    };
  };
} NVMADRBITS;
extern volatile NVMADRBITS NVMADRbits __attribute__((__sfr__));

#define NVMADRL NVMADRL
extern volatile uint16_t NVMADRL __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRLBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t NVMADRL:15;
    };
    struct {
      uint16_t :1;
      uint16_t NVMADR:15;
    };
  };
} NVMADRLBITS;
extern volatile NVMADRLBITS NVMADRLbits __attribute__((__sfr__));

#define NVMADRH NVMADRH
extern volatile uint16_t NVMADRH __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRHBITS {
  union {
    struct {
      uint16_t NVMADRH:8;
    };
    struct {
      uint16_t NVMADRU:8;
    };
  };
} NVMADRHBITS;
extern volatile NVMADRHBITS NVMADRHbits __attribute__((__sfr__));

#define NVMADRU NVMADRU
extern volatile uint16_t NVMADRU __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRUBITS {
  union {
    struct {
      uint16_t NVMADRH:8;
    };
    struct {
      uint16_t NVMADRU:8;
    };
  };
} NVMADRUBITS;
extern volatile NVMADRUBITS NVMADRUbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile uint16_t NVMKEY __attribute__((__sfr__));
#define NVMSRCADDR NVMSRCADDR
extern volatile uint16_t NVMSRCADDR __attribute__((__sfr__));
typedef struct tagNVMSRCADDRBITS {
  uint16_t :1;
  uint16_t NVMSRCADRL:15;
} NVMSRCADDRBITS;
extern volatile NVMSRCADDRBITS NVMSRCADDRbits __attribute__((__sfr__));

#define NVMSRCADR NVMSRCADR
extern volatile uint16_t NVMSRCADR __attribute__((__sfr__));
typedef struct tagNVMSRCADRBITS {
  uint16_t :1;
  uint16_t NVMSRCADRL:15;
} NVMSRCADRBITS;
extern volatile NVMSRCADRBITS NVMSRCADRbits __attribute__((__sfr__));

#define NVMSRCADRL NVMSRCADRL
extern volatile uint16_t NVMSRCADRL __attribute__((__sfr__));
typedef struct tagNVMSRCADRLBITS {
  uint16_t :1;
  uint16_t NVMSRCADRL:15;
} NVMSRCADRLBITS;
extern volatile NVMSRCADRLBITS NVMSRCADRLbits __attribute__((__sfr__));

