MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA406/mcu.h
#define _CTMUCON1H_EDG1POL_POSITION              0x0000000E
#define _CTMUCON1H_EDG1POL_MASK                  0x00004000
#define _CTMUCON1H_EDG1POL_LENGTH                0x00000001

#define _CTMUCON1H_EDG1MOD_POSITION              0x0000000F
#define _CTMUCON1H_EDG1MOD_MASK                  0x00008000
#define _CTMUCON1H_EDG1MOD_LENGTH                0x00000001

#define _CTMUCON1H_EDG2SEL0_POSITION             0x00000002
#define _CTMUCON1H_EDG2SEL0_MASK                 0x00000004
#define _CTMUCON1H_EDG2SEL0_LENGTH               0x00000001

#define _CTMUCON1H_EDG2SEL1_POSITION             0x00000003
#define _CTMUCON1H_EDG2SEL1_MASK                 0x00000008
#define _CTMUCON1H_EDG2SEL1_LENGTH               0x00000001

#define _CTMUCON1H_EDG2SEL2_POSITION             0x00000004
#define _CTMUCON1H_EDG2SEL2_MASK                 0x00000010
#define _CTMUCON1H_EDG2SEL2_LENGTH               0x00000001

#define _CTMUCON1H_EDG2SEL3_POSITION             0x00000005
#define _CTMUCON1H_EDG2SEL3_MASK                 0x00000020
#define _CTMUCON1H_EDG2SEL3_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL0_POSITION             0x0000000A
#define _CTMUCON1H_EDG1SEL0_MASK                 0x00000400
#define _CTMUCON1H_EDG1SEL0_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL1_POSITION             0x0000000B
#define _CTMUCON1H_EDG1SEL1_MASK                 0x00000800
#define _CTMUCON1H_EDG1SEL1_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL2_POSITION             0x0000000C
#define _CTMUCON1H_EDG1SEL2_MASK                 0x00001000
#define _CTMUCON1H_EDG1SEL2_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL3_POSITION             0x0000000D
#define _CTMUCON1H_EDG1SEL3_MASK                 0x00002000
#define _CTMUCON1H_EDG1SEL3_LENGTH               0x00000001

#define _CTMUCON2_DISCHS_POSITION                0x00000000
#define _CTMUCON2_DISCHS_MASK                    0x00000007
#define _CTMUCON2_DISCHS_LENGTH                  0x00000003

#define _CTMUCON2_IRSTEN_POSITION                0x00000004
#define _CTMUCON2_IRSTEN_MASK                    0x00000010
#define _CTMUCON2_IRSTEN_LENGTH                  0x00000001

#define _CTMUCON2_DISCHS0_POSITION               0x00000000
#define _CTMUCON2_DISCHS0_MASK                   0x00000001
#define _CTMUCON2_DISCHS0_LENGTH                 0x00000001

#define _CTMUCON2_DISCHS1_POSITION               0x00000001
#define _CTMUCON2_DISCHS1_MASK                   0x00000002
#define _CTMUCON2_DISCHS1_LENGTH                 0x00000001

#define _CTMUCON2_DISCHS2_POSITION               0x00000002
#define _CTMUCON2_DISCHS2_MASK                   0x00000004
#define _CTMUCON2_DISCHS2_LENGTH                 0x00000001

#define _CTMUCON2L_DISCHS_POSITION               0x00000000
#define _CTMUCON2L_DISCHS_MASK                   0x00000007
#define _CTMUCON2L_DISCHS_LENGTH                 0x00000003

#define _CTMUCON2L_IRSTEN_POSITION               0x00000004
#define _CTMUCON2L_IRSTEN_MASK                   0x00000010
#define _CTMUCON2L_IRSTEN_LENGTH                 0x00000001

#define _CTMUCON2L_DISCHS0_POSITION              0x00000000
#define _CTMUCON2L_DISCHS0_MASK                  0x00000001
#define _CTMUCON2L_DISCHS0_LENGTH                0x00000001

#define _CTMUCON2L_DISCHS1_POSITION              0x00000001
#define _CTMUCON2L_DISCHS1_MASK                  0x00000002
#define _CTMUCON2L_DISCHS1_LENGTH                0x00000001

#define _CTMUCON2L_DISCHS2_POSITION              0x00000002
#define _CTMUCON2L_DISCHS2_MASK                  0x00000004
#define _CTMUCON2L_DISCHS2_LENGTH                0x00000001

#define _RTCCON1L_TSAEN_POSITION                 0x00000000
#define _RTCCON1L_TSAEN_MASK                     0x00000001
#define _RTCCON1L_TSAEN_LENGTH                   0x00000001

#define _RTCCON1L_TSBEN_POSITION                 0x00000001
#define _RTCCON1L_TSBEN_MASK                     0x00000002
#define _RTCCON1L_TSBEN_LENGTH                   0x00000001

#define _RTCCON1L_OUTSEL_POSITION                0x00000004
#define _RTCCON1L_OUTSEL_MASK                    0x00000070
#define _RTCCON1L_OUTSEL_LENGTH                  0x00000003

#define _RTCCON1L_RTCOE_POSITION                 0x00000007
#define _RTCCON1L_RTCOE_MASK                     0x00000080
#define _RTCCON1L_RTCOE_LENGTH                   0x00000001

#define _RTCCON1L_PWCPOE_POSITION                0x00000008
#define _RTCCON1L_PWCPOE_MASK                    0x00000100
#define _RTCCON1L_PWCPOE_LENGTH                  0x00000001

#define _RTCCON1L_PWCPOL_POSITION                0x00000009
#define _RTCCON1L_PWCPOL_MASK                    0x00000200
#define _RTCCON1L_PWCPOL_LENGTH                  0x00000001

#define _RTCCON1L_PWCEN_POSITION                 0x0000000A
#define _RTCCON1L_PWCEN_MASK                     0x00000400
#define _RTCCON1L_PWCEN_LENGTH                   0x00000001

#define _RTCCON1L_WRLOCK_POSITION                0x0000000B
#define _RTCCON1L_WRLOCK_MASK                    0x00000800
#define _RTCCON1L_WRLOCK_LENGTH                  0x00000001

#define _RTCCON1L_RTCEN_POSITION                 0x0000000F
#define _RTCCON1L_RTCEN_MASK                     0x00008000
#define _RTCCON1L_RTCEN_LENGTH                   0x00000001

#define _RTCCON1H_ALMRPT_POSITION                0x00000000
#define _RTCCON1H_ALMRPT_MASK                    0x000000FF
#define _RTCCON1H_ALMRPT_LENGTH                  0x00000008

#define _RTCCON1H_AMASK_POSITION                 0x00000008
#define _RTCCON1H_AMASK_MASK                     0x00000F00
#define _RTCCON1H_AMASK_LENGTH                   0x00000004

#define _RTCCON1H_CHIME_POSITION                 0x0000000E
#define _RTCCON1H_CHIME_MASK                     0x00004000
#define _RTCCON1H_CHIME_LENGTH                   0x00000001

#define _RTCCON1H_ALRMEN_POSITION                0x0000000F
#define _RTCCON1H_ALRMEN_MASK                    0x00008000
#define _RTCCON1H_ALRMEN_LENGTH                  0x00000001

#define _RTCCON2L_CLKSEL_POSITION                0x00000000
#define _RTCCON2L_CLKSEL_MASK                    0x00000003
#define _RTCCON2L_CLKSEL_LENGTH                  0x00000002

