MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA406/mcu.h
#define _U2STA_URXISEL1_POSITION                 0x00000007
#define _U2STA_URXISEL1_MASK                     0x00000080
#define _U2STA_URXISEL1_LENGTH                   0x00000001

#define _U2TXREG_LAST_POSITION                   0x0000000F
#define _U2TXREG_LAST_MASK                       0x00008000
#define _U2TXREG_LAST_LENGTH                     0x00000001

#define _U2ADMD_ADMADDR_POSITION                 0x00000000
#define _U2ADMD_ADMADDR_MASK                     0x000000FF
#define _U2ADMD_ADMADDR_LENGTH                   0x00000008

#define _U2ADMD_ADMMASK_POSITION                 0x00000008
#define _U2ADMD_ADMMASK_MASK                     0x0000FF00
#define _U2ADMD_ADMMASK_LENGTH                   0x00000008

#define _U2ADMD_ADMADDR0_POSITION                0x00000000
#define _U2ADMD_ADMADDR0_MASK                    0x00000001
#define _U2ADMD_ADMADDR0_LENGTH                  0x00000001

#define _U2ADMD_ADMADDR1_POSITION                0x00000001
#define _U2ADMD_ADMADDR1_MASK                    0x00000002
#define _U2ADMD_ADMADDR1_LENGTH                  0x00000001

#define _U2ADMD_ADMADDR2_POSITION                0x00000002
#define _U2ADMD_ADMADDR2_MASK                    0x00000004
#define _U2ADMD_ADMADDR2_LENGTH                  0x00000001

#define _U2ADMD_ADMADDR3_POSITION                0x00000003
#define _U2ADMD_ADMADDR3_MASK                    0x00000008
#define _U2ADMD_ADMADDR3_LENGTH                  0x00000001

#define _U2ADMD_ADMADDR4_POSITION                0x00000004
#define _U2ADMD_ADMADDR4_MASK                    0x00000010
#define _U2ADMD_ADMADDR4_LENGTH                  0x00000001

#define _U2ADMD_ADMADDR5_POSITION                0x00000005
#define _U2ADMD_ADMADDR5_MASK                    0x00000020
#define _U2ADMD_ADMADDR5_LENGTH                  0x00000001

#define _U2ADMD_ADMADDR6_POSITION                0x00000006
#define _U2ADMD_ADMADDR6_MASK                    0x00000040
#define _U2ADMD_ADMADDR6_LENGTH                  0x00000001

#define _U2ADMD_ADMADDR7_POSITION                0x00000007
#define _U2ADMD_ADMADDR7_MASK                    0x00000080
#define _U2ADMD_ADMADDR7_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK0_POSITION                0x00000008
#define _U2ADMD_ADMMASK0_MASK                    0x00000100
#define _U2ADMD_ADMMASK0_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK1_POSITION                0x00000009
#define _U2ADMD_ADMMASK1_MASK                    0x00000200
#define _U2ADMD_ADMMASK1_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK2_POSITION                0x0000000A
#define _U2ADMD_ADMMASK2_MASK                    0x00000400
#define _U2ADMD_ADMMASK2_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK3_POSITION                0x0000000B
#define _U2ADMD_ADMMASK3_MASK                    0x00000800
#define _U2ADMD_ADMMASK3_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK4_POSITION                0x0000000C
#define _U2ADMD_ADMMASK4_MASK                    0x00001000
#define _U2ADMD_ADMMASK4_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK5_POSITION                0x0000000D
#define _U2ADMD_ADMMASK5_MASK                    0x00002000
#define _U2ADMD_ADMMASK5_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK6_POSITION                0x0000000E
#define _U2ADMD_ADMMASK6_MASK                    0x00004000
#define _U2ADMD_ADMMASK6_LENGTH                  0x00000001

#define _U2ADMD_ADMMASK7_POSITION                0x0000000F
#define _U2ADMD_ADMMASK7_MASK                    0x00008000
#define _U2ADMD_ADMMASK7_LENGTH                  0x00000001

#define _U2SCCON_SCEN_POSITION                   0x00000000
#define _U2SCCON_SCEN_MASK                       0x00000001
#define _U2SCCON_SCEN_LENGTH                     0x00000001

#define _U2SCCON_PTRCL_POSITION                  0x00000001
#define _U2SCCON_PTRCL_MASK                      0x00000002
#define _U2SCCON_PTRCL_LENGTH                    0x00000001

#define _U2SCCON_T0PD_POSITION                   0x00000002
#define _U2SCCON_T0PD_MASK                       0x00000004
#define _U2SCCON_T0PD_LENGTH                     0x00000001

#define _U2SCCON_CONV_POSITION                   0x00000003
#define _U2SCCON_CONV_MASK                       0x00000008
#define _U2SCCON_CONV_LENGTH                     0x00000001

#define _U2SCCON_TXRPT_POSITION                  0x00000004
#define _U2SCCON_TXRPT_MASK                      0x00000030
#define _U2SCCON_TXRPT_LENGTH                    0x00000002

#define _U2SCCON_TXRPT0_POSITION                 0x00000004
#define _U2SCCON_TXRPT0_MASK                     0x00000010
#define _U2SCCON_TXRPT0_LENGTH                   0x00000001

#define _U2SCCON_TXRPT1_POSITION                 0x00000005
#define _U2SCCON_TXRPT1_MASK                     0x00000020
#define _U2SCCON_TXRPT1_LENGTH                   0x00000001

#define _U2SCINT_GTCIE_POSITION                  0x00000000
#define _U2SCINT_GTCIE_MASK                      0x00000001
#define _U2SCINT_GTCIE_LENGTH                    0x00000001

#define _U2SCINT_WTCIE_POSITION                  0x00000001
#define _U2SCINT_WTCIE_MASK                      0x00000002
#define _U2SCINT_WTCIE_LENGTH                    0x00000001

#define _U2SCINT_TXRPTIE_POSITION                0x00000004
#define _U2SCINT_TXRPTIE_MASK                    0x00000010
#define _U2SCINT_TXRPTIE_LENGTH                  0x00000001

#define _U2SCINT_RXRPTIE_POSITION                0x00000005
#define _U2SCINT_RXRPTIE_MASK                    0x00000020
#define _U2SCINT_RXRPTIE_LENGTH                  0x00000001

#define _U2SCINT_PARIE_POSITION                  0x00000006
#define _U2SCINT_PARIE_MASK                      0x00000040
#define _U2SCINT_PARIE_LENGTH                    0x00000001

#define _U2SCINT_GTCIF_POSITION                  0x00000008
#define _U2SCINT_GTCIF_MASK                      0x00000100
#define _U2SCINT_GTCIF_LENGTH                    0x00000001

#define _U2SCINT_WTCIF_POSITION                  0x00000009
#define _U2SCINT_WTCIF_MASK                      0x00000200
#define _U2SCINT_WTCIF_LENGTH                    0x00000001

