MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA406/mcu.h
#define _IOCPDB_CNPDB6_POSITION                  0x00000006
#define _IOCPDB_CNPDB6_MASK                      0x00000040
#define _IOCPDB_CNPDB6_LENGTH                    0x00000001

#define _IOCPDB_CNPDB7_POSITION                  0x00000007
#define _IOCPDB_CNPDB7_MASK                      0x00000080
#define _IOCPDB_CNPDB7_LENGTH                    0x00000001

#define _IOCPDB_CNPDB8_POSITION                  0x00000008
#define _IOCPDB_CNPDB8_MASK                      0x00000100
#define _IOCPDB_CNPDB8_LENGTH                    0x00000001

#define _IOCPDB_CNPDB9_POSITION                  0x00000009
#define _IOCPDB_CNPDB9_MASK                      0x00000200
#define _IOCPDB_CNPDB9_LENGTH                    0x00000001

#define _IOCPDB_CNPDB10_POSITION                 0x0000000A
#define _IOCPDB_CNPDB10_MASK                     0x00000400
#define _IOCPDB_CNPDB10_LENGTH                   0x00000001

#define _IOCPDB_CNPDB11_POSITION                 0x0000000B
#define _IOCPDB_CNPDB11_MASK                     0x00000800
#define _IOCPDB_CNPDB11_LENGTH                   0x00000001

#define _IOCPDB_CNPDB12_POSITION                 0x0000000C
#define _IOCPDB_CNPDB12_MASK                     0x00001000
#define _IOCPDB_CNPDB12_LENGTH                   0x00000001

#define _IOCPDB_CNPDB13_POSITION                 0x0000000D
#define _IOCPDB_CNPDB13_MASK                     0x00002000
#define _IOCPDB_CNPDB13_LENGTH                   0x00000001

#define _IOCPDB_CNPDB14_POSITION                 0x0000000E
#define _IOCPDB_CNPDB14_MASK                     0x00004000
#define _IOCPDB_CNPDB14_LENGTH                   0x00000001

#define _IOCPDB_CNPDB15_POSITION                 0x0000000F
#define _IOCPDB_CNPDB15_MASK                     0x00008000
#define _IOCPDB_CNPDB15_LENGTH                   0x00000001

#define _TRISC_TRISC12_POSITION                  0x0000000C
#define _TRISC_TRISC12_MASK                      0x00001000
#define _TRISC_TRISC12_LENGTH                    0x00000001

#define _TRISC_TRISC13_POSITION                  0x0000000D
#define _TRISC_TRISC13_MASK                      0x00002000
#define _TRISC_TRISC13_LENGTH                    0x00000001

#define _TRISC_TRISC14_POSITION                  0x0000000E
#define _TRISC_TRISC14_MASK                      0x00004000
#define _TRISC_TRISC14_LENGTH                    0x00000001

#define _TRISC_TRISC15_POSITION                  0x0000000F
#define _TRISC_TRISC15_MASK                      0x00008000
#define _TRISC_TRISC15_LENGTH                    0x00000001

#define _PORTC_RC12_POSITION                     0x0000000C
#define _PORTC_RC12_MASK                         0x00001000
#define _PORTC_RC12_LENGTH                       0x00000001

#define _PORTC_RC13_POSITION                     0x0000000D
#define _PORTC_RC13_MASK                         0x00002000
#define _PORTC_RC13_LENGTH                       0x00000001

#define _PORTC_RC14_POSITION                     0x0000000E
#define _PORTC_RC14_MASK                         0x00004000
#define _PORTC_RC14_LENGTH                       0x00000001

#define _PORTC_RC15_POSITION                     0x0000000F
#define _PORTC_RC15_MASK                         0x00008000
#define _PORTC_RC15_LENGTH                       0x00000001

#define _LATC_LATC12_POSITION                    0x0000000C
#define _LATC_LATC12_MASK                        0x00001000
#define _LATC_LATC12_LENGTH                      0x00000001

#define _LATC_LATC15_POSITION                    0x0000000F
#define _LATC_LATC15_MASK                        0x00008000
#define _LATC_LATC15_LENGTH                      0x00000001

#define _ODCC_ODCC12_POSITION                    0x0000000C
#define _ODCC_ODCC12_MASK                        0x00001000
#define _ODCC_ODCC12_LENGTH                      0x00000001

#define _ODCC_ODCC15_POSITION                    0x0000000F
#define _ODCC_ODCC15_MASK                        0x00008000
#define _ODCC_ODCC15_LENGTH                      0x00000001

#define _IOCPC_IOCPC12_POSITION                  0x0000000C
#define _IOCPC_IOCPC12_MASK                      0x00001000
#define _IOCPC_IOCPC12_LENGTH                    0x00000001

#define _IOCPC_IOCPC13_POSITION                  0x0000000D
#define _IOCPC_IOCPC13_MASK                      0x00002000
#define _IOCPC_IOCPC13_LENGTH                    0x00000001

#define _IOCPC_IOCPC14_POSITION                  0x0000000E
#define _IOCPC_IOCPC14_MASK                      0x00004000
#define _IOCPC_IOCPC14_LENGTH                    0x00000001

#define _IOCPC_IOCPC15_POSITION                  0x0000000F
#define _IOCPC_IOCPC15_MASK                      0x00008000
#define _IOCPC_IOCPC15_LENGTH                    0x00000001

#define _IOCNC_IOCNC12_POSITION                  0x0000000C
#define _IOCNC_IOCNC12_MASK                      0x00001000
#define _IOCNC_IOCNC12_LENGTH                    0x00000001

#define _IOCNC_IOCNC13_POSITION                  0x0000000D
#define _IOCNC_IOCNC13_MASK                      0x00002000
#define _IOCNC_IOCNC13_LENGTH                    0x00000001

#define _IOCNC_IOCNC14_POSITION                  0x0000000E
#define _IOCNC_IOCNC14_MASK                      0x00004000
#define _IOCNC_IOCNC14_LENGTH                    0x00000001

#define _IOCNC_IOCNC15_POSITION                  0x0000000F
#define _IOCNC_IOCNC15_MASK                      0x00008000
#define _IOCNC_IOCNC15_LENGTH                    0x00000001

#define _IOCFC_IOCFC12_POSITION                  0x0000000C
#define _IOCFC_IOCFC12_MASK                      0x00001000
#define _IOCFC_IOCFC12_LENGTH                    0x00000001

#define _IOCFC_IOCFC13_POSITION                  0x0000000D
#define _IOCFC_IOCFC13_MASK                      0x00002000
#define _IOCFC_IOCFC13_LENGTH                    0x00000001

#define _IOCFC_IOCFC14_POSITION                  0x0000000E
#define _IOCFC_IOCFC14_MASK                      0x00004000
#define _IOCFC_IOCFC14_LENGTH                    0x00000001

#define _IOCFC_IOCFC15_POSITION                  0x0000000F
#define _IOCFC_IOCFC15_MASK                      0x00008000
#define _IOCFC_IOCFC15_LENGTH                    0x00000001

#define _CNPUC_IOCPC12_POSITION                  0x0000000C
#define _CNPUC_IOCPC12_MASK                      0x00001000
#define _CNPUC_IOCPC12_LENGTH                    0x00000001

